"""Задание 3. Файлы
Что нужно сделать
В IT-компании есть негласные правила именования текстовых документов:

Название файла не может начинаться с одного из специальных символов: @, №, $, %, ^, &, *, ().
Файл должен заканчиваться расширением .txt или .docx.
Напишите программу, которая получает на вход полное название файла и проверяет, соответствует ли он этим правилам.

Пример 1

Название файла: @example.txt.

Ошибка: название начинается недопустимым символом.

Пример 2

Название файла: example.ttx.

Ошибка: неверное расширение файла. Ожидалось .txt или .docx.

Пример 3

Название файла: example.txt.

Файл назван верно."""